W7D2/MusicApp/app/views/albums/new.html.erb

SELECT "bands".* FROM "bands"
---
        <select>
            <%Band.all.each do |band|%>