W8D1/RedditClone/app/controllers/comments_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sub = Sub.find(params[:sub_id])
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "FUCKIGS:DASGHO:"], ["user_id", 31], ["post_id", 2], ["created_at", "2019-12-03 00:58:48.417868"], ["updated_at", "2019-12-03 00:58:48.417868"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @comment.post_id = params[:post_id]
    if params[:id]
      @comment.parent_id = params[:id]
    end
    @sub = params[:sub_id]
    @post = params[:post_id]
    @comment.save