W8D1/RedditClone/app/controllers/posts_controller.rb

  def new
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"

  def show
    @sub = Sub.find(params[:sub_id])
    @post = Post.find(params[:id])
    @comments = @post.comments.where(parent_id: nil)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_id" IS NULL  [["post_id", 2]]

  def create
    @subs = Sub.all
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    # debugger
    if @post.save
      params[:sub_ids].each do |sub_id|
        PostSub.create!(post_id: @post.id, sub_id: sub_id)
---
SELECT  "subs".* FROM "subs" ORDER BY "subs"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["url", "test"], ["content", "test"], ["user_id", 31], ["created_at", "2019-12-02 23:31:01.655040"], ["updated_at", "2019-12-02 23:31:01.655040"]]
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["url", "test"], ["content", "test"], ["user_id", 1], ["created_at", "2019-12-02 22:33:36.309143"], ["updated_at", "2019-12-02 22:33:36.309143"]]
INSERT INTO "post_subs" ("post_id", "sub_id") VALUES ($1, $2)  [["post_id", 9], ["sub_id", 10]]

  def edit
    @sub = Sub.find(params[:sub_id])
    @post = Post.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @sub = Sub.find(params[:sub_id])
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "MEOW MEOW"], ["updated_at", "2019-12-02 20:17:17.837883"], ["id", 2]]

  def is_op?
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]