W8D1/RedditClone/app/controllers/subs_controller.rb

  def is_moderator?
    @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]