W6D3/ArtworkAPI/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE ("comments"."author_id" = $1 OR "comments"."artwork_id" IS NULL)  [["author_id", 1]]
---
  def index
    comment = Comment.where(author_id: params[:user_id])

SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
---
  def artwork_index
    comment = Comment.where(artwork: params[:artwork_id])