W6D3/ArtworkAPI/app/controllers/users_controller.rb

  def index
    user = User.where("username LIKE ?", params[:username])
    if user.empty?
      render json: User.all
---
SELECT "users".* FROM "users" WHERE (name LIKE 'sillyanne')
SELECT  1 AS one FROM "users" WHERE (username LIKE NULL) LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (username LIKE NULL)